app/controllers/games_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "6"]]
SELECT "games".* FROM "games" WHERE "games"."user_id" = 6
---
  def index
    @user = User.find(params[:id])
    @games = Game.where(:user_id => params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "games".* FROM "games" WHERE "games"."id" IS NULL LIMIT 1
---
  def show
    @user = User.find(params[:id])
    @game = Game.find_by_id(params[:game_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "6"]]
---
  def new
    @user = User.find(params[:id])